#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      - realm_id   = "moh_applications" -> null
      - role_ids   = [
          - "1412174e-6e26-4e67-8c6c-d9e5cb026ee3",
          - "32c23ef4-0d36-4f62-8da1-534cc7e15ff4",
          - "8e272912-747f-4dc9-a732-f49765bd76e7",
          - "a526a996-86be-4296-b1bf-8a4daee18342",
          - "bd3a3222-7092-48ef-a0be-44b02adb47cf",
          - "f2d401d1-2c5e-4fc2-8f94-9ad328732ff7",
        ] -> null
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.CGI-REGISTRIES-ADMIN.keycloak_group.GROUP will be created
  + resource "keycloak_group" "GROUP" {
      + id       = (known after apply)
      + name     = "CGI Registries Admin"
      + path     = (known after apply)
      + realm_id = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.CGI-REGISTRIES-ADMIN.keycloak_group_roles.GROUP_ROLES will be created
  + resource "keycloak_group_roles" "GROUP_ROLES" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "moh_applications"
      + role_ids   = [
          + "06799768-828d-4299-832b-0cc7a56684b0",
          + "4386dcb7-036e-4b45-bec9-e60d7b963bf9",
          + "4b554dbe-6f89-4798-824b-d2e290595f92",
          + "55179234-d6b5-4549-9e21-159bc9800425",
          + "5f998ee4-6cc5-46f4-909c-32dd02bd6ae0",
          + "68933fe3-7eb8-44d8-b020-beeb54fade3d",
          + "77549ee3-e29e-41cc-b653-f5f0d5f417ed",
          + "84222c92-8abf-4021-abea-047cd461ae21",
          + "8bea7469-b2b6-4799-b914-91ee2221a15a",
          + "9130f6c7-1d49-4f21-8a18-0db979ca1eb6",
          + "91d9434c-b2cc-49a9-af56-4ac20d35477b",
          + "a49c93c3-6bf3-4e8a-8b90-dff7e1f40151",
          + "b05e8da8-3737-4684-8523-612d902deaa2",
          + "bc49c66e-fd42-4d7d-b27c-a04069aa35e7",
          + "cc8e2983-2eee-4f21-b47e-4953d272a4fd",
          + "cda7bc35-a61c-4822-b0cb-0c45ebe626cc",
          + "d5086c42-6157-4da9-89cd-54721ab9e97d",
          + "db8e9223-4a9e-4700-bbd9-2f7ac047790a",
          + "dc4020f7-1ffa-4515-8277-26466c54511c",
          + "f8778dbf-d583-41f0-8208-99ebc9567ad7",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.REGISTRIES-ADMIN.keycloak_group.GROUP will be destroyed
  # (because keycloak_group.GROUP is not in configuration)
  - resource "keycloak_group" "GROUP" {
      - attributes = {} -> null
      - id         = "9782254e-fe90-4901-85f0-0ad253ae181d" -> null
      - name       = "CGI Registries Admin" -> null
      - path       = "/CGI Registries Admin" -> null
      - realm_id   = "moh_applications" -> null
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.REGISTRIES-ADMIN.keycloak_group_roles.GROUP_ROLES will be destroyed
  # (because keycloak_group_roles.GROUP_ROLES is not in configuration)
  - resource "keycloak_group_roles" "GROUP_ROLES" {
      - exhaustive = true -> null
      - group_id   = "9782254e-fe90-4901-85f0-0ad253ae181d" -> null
      - id         = "moh_applications/9782254e-fe90-4901-85f0-0ad253ae181d" -> null
      - realm_id   = "moh_applications" -> null
      - role_ids   = [
          - "06799768-828d-4299-832b-0cc7a56684b0",
          - "1412174e-6e26-4e67-8c6c-d9e5cb026ee3",
          - "32c23ef4-0d36-4f62-8da1-534cc7e15ff4",
          - "4386dcb7-036e-4b45-bec9-e60d7b963bf9",
          - "4b554dbe-6f89-4798-824b-d2e290595f92",
          - "55179234-d6b5-4549-9e21-159bc9800425",
          - "5f998ee4-6cc5-46f4-909c-32dd02bd6ae0",
          - "68933fe3-7eb8-44d8-b020-beeb54fade3d",
          - "77549ee3-e29e-41cc-b653-f5f0d5f417ed",
          - "84222c92-8abf-4021-abea-047cd461ae21",
          - "8bea7469-b2b6-4799-b914-91ee2221a15a",
          - "8e272912-747f-4dc9-a732-f49765bd76e7",
          - "9130f6c7-1d49-4f21-8a18-0db979ca1eb6",
          - "91d9434c-b2cc-49a9-af56-4ac20d35477b",
          - "a49c93c3-6bf3-4e8a-8b90-dff7e1f40151",
          - "b05e8da8-3737-4684-8523-612d902deaa2",
          - "bc49c66e-fd42-4d7d-b27c-a04069aa35e7",
          - "cc8e2983-2eee-4f21-b47e-4953d272a4fd",
          - "cda7bc35-a61c-4822-b0cb-0c45ebe626cc",
          - "d5086c42-6157-4da9-89cd-54721ab9e97d",
          - "db8e9223-4a9e-4700-bbd9-2f7ac047790a",
          - "dc4020f7-1ffa-4515-8277-26466c54511c",
          - "f8778dbf-d583-41f0-8208-99ebc9567ad7",
        ] -> null
    }

Plan: 2 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sharpedavid, Action: `pull_request`*